In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("transactions.csv")
df

,t_date,cust_id,t_amt,services,products_used,city,state,t_details
0,06-26-2015,4007024,40.33,Exercise & Fitness,Cardio Machine Accessories,Clarksville,Tennessee,credit
1,05-26-2015,4006742,198.44,Exercise & Fitness,Weightlifting Gloves,Long Beach,California,credit
2,06-01-2015,4009775,5.58,Exercise & Fitness,Weightlifting Machine Accessories,Anaheim,California,credit
3,06-05-2015,4002199,198.19,Gymnastics,Gymnastics Rings,Milwaukee,Wisconsin,credit
4,12-17-2015,4002613,98.81,Team Sports,Field Hockey,Nashville,Tennessee,credit
...,...,...,...,...,...,...,...,...
49995,09-18-2015,4005664,53.95,Games,Dice Games,Irving,Texas,credit
49996,10-02-2015,4007287,163.81,Games,Poker Chips & Sets,Kansas City,Missouri,credit
49997,05-03-2015,4003954,35.85,Racquet Sports,Squash,New Orleans,Louisiana,cash
49998,10-23-2015,4007843,180.41,Gymnastics,Vaulting Horses,Berkeley,California,credit
49999,12-14-2015,4001406,168.49,Team Sports,Team Handball,Rockford,Illinois,credit

In [3]:
#1 total sales amount across all trasactions
total_sales = df["t_amt"].sum()
print(total_sales)

5110820.54

In [12]:
#2 Convert t_date column to datetime (MM-DD-YYYY format)
df["t_date"] = pd.to_datetime(df["t_date"], format="%m-%d-%Y", errors="coerce")

# Drop rows where date conversion failed (if any)
df = df.dropna(subset=["t_date"])

# Extract Year-Month
df["month"] = df["t_date"].dt.to_period("M")

# Group by month and sum transaction amount
monthly_sales = df.groupby("month")["t_amt"].sum()

# Find month with highest total sales
highest_month = monthly_sales.idxmax()
highest_amount = monthly_sales.max()

print("Month with Highest Total Transaction Amount:", highest_month)
print("Total Sales Amount:", round(highest_amount, 2))

Month with Highest Total Transaction Amount: 2015-03
Total Sales Amount: 444664.24

In [13]:
#3 Calculate average transaction amount per customer
avg_per_customer = df.groupby("cust_id")["t_amt"].mean()
print("Average transaction amount per customer:")
print(avg_per_customer.head())
overall_avg = avg_per_customer.mean()
print("\nOverall Average Transaction Amount per Customer:", round(overall_avg, 2))

Average transaction amount per customer:
cust_id
4000000    127.444000
4000001    108.945556
4000002     56.165000
4000003    123.670000
4000004    168.135000
Name: t_amt, dtype: float64

Overall Average Transaction Amount per Customer: 101.98

In [15]:
text = "hi my id sumit@gmail.com , and nagul@tekwork.com"
words = text.split()
for word in words:
    word = word.strip(",.")   # remove punctuation
    if "@" in word and "." in word:
        print(word)

sumit@gmail.com
nagul@tekwork.com

In [3]:
#4.What is the trend of total sales over months?
df["t_date"] = pd.to_datetime(df["t_date"], errors="coerce")
df["month"] = df["t_date"].dt.month
t_sale_month = df.groupby("t_date")["month"].sum().reset_index(name="t_sale_month")
t_sale_month

        t_date  t_sale_month
0   2015-01-01           126
1   2015-01-02           138
2   2015-01-03           137
3   2015-01-04           129
4   2015-01-05           149
..         ...           ...
359 2015-12-26          1752
360 2015-12-27          1692
361 2015-12-28          1728
362 2015-12-29          1716
363 2015-12-30          1872

[364 rows x 2 columns]

In [4]:
#5.What is the highest single transaction amount recorded?
high_sale = df["t_amt"].max()
high_sale

200.0

In [5]:
#6.Which service category contributes the most to total revenue?
serv_t_sale = df.groupby("services")['t_amt'].sum().reset_index(name="serv_t_sale")
serv_t_sale

                  services  serv_t_sale
0               Air Sports     99316.90
1            Combat Sports    164730.67
2                  Dancing     42603.71
3       Exercise & Fitness    766463.87
4                    Games    374932.70
5               Gymnastics    327225.34
6             Indoor Games    288506.04
7                  Jumping    205842.67
8   Outdoor Play Equipment    294728.28
9       Outdoor Recreation    846678.64
10                 Puzzles     61564.75
11          Racquet Sports    166976.06
12             Team Sports    617461.38
13            Water Sports    531815.97
14           Winter Sports    321973.56

In [6]:
#7.Which product generated the highest revenue?
high_rev_prod = df.groupby("products_used")["t_amt"].sum().reset_index(name="high_rev_prod")
high_rev_prod

           products_used  high_rev_prod
0    Abdominal Equipment       43304.11
1             Air Hockey       40161.11
2              Air Suits       19371.57
3                Archery       37088.66
4              Badminton       44786.19
..                   ...            ...
120             Wetsuits       38980.34
121   Whitewater Rafting       41048.22
122          Windsurfing       43018.68
123            Wrestling       40332.89
124       Yoga & Pilates       47804.94

[125 rows x 2 columns]

In [7]:
#8.How does the average transaction amount vary between services?
avg_trans = df.groupby("services")["t_amt"].mean().reset_index(name="avg_trans")
avg_trans

                  services   avg_trans
0               Air Sports  103.455104
1            Combat Sports  101.061761
2                  Dancing  102.907512
3       Exercise & Fitness  103.660247
4                    Games  102.272968
5               Gymnastics  102.385901
6             Indoor Games  103.074684
7                  Jumping  102.155171
8   Outdoor Play Equipment  101.281196
9       Outdoor Recreation  100.999480
10                 Puzzles  100.595997
11          Racquet Sports  103.647461
12             Team Sports  102.738998
13            Water Sports  101.899975
14           Winter Sports  101.217718

In [8]:
#9.How many unique customers made purchases?
uniq_cust = df['cust_id'].nunique()
uniq_cust

9926

In [9]:
#10.Which customers have spent the most overall?
cust_spent = df.groupby("cust_id")['t_amt'].mean().reset_index(name="cust_spent").head(10)
cust_spent

   cust_id  cust_spent
0  4000000  127.444000
1  4000001  108.945556
2  4000002   56.165000
3  4000003  123.670000
4  4000004  168.135000
5  4000005  135.052500
6  4000006   61.336667
7  4000007  102.808571
8  4000009   91.172500
9  4000010   53.600000

In [10]:
#11.What is the average number of transactions per customer?
avg_no_of_trans = df.groupby("cust_id").size().mean()
avg_no_of_trans

5.037275841225066

In [11]:
#12.Are there customers who made multiple purchases in different categories?
multi_cust_pur = df.groupby('cust_id')['services'].nunique().reset_index(name="multi_cust_pur")
multi_cust_pur

      cust_id  multi_cust_pur
0     4000000               4
1     4000001               8
2     4000002               2
3     4000003               3
4     4000004               3
...       ...             ...
9921  4009995               4
9922  4009996               6
9923  4009997               4
9924  4009998               4
9925  4009999               5

[9926 rows x 2 columns]

In [12]:
#13.What percentage of customers are repeat buyers?
repeat = df.groupby('cust_id').size()
(repeat[repeat>1].count()/repeat.count())*100

96.5645778762845

In [13]:
#14.Which product category has the highest total sales?
catgy_high_sale = df.groupby("services")['t_amt'].sum().reset_index(name="catgy_high_sale")
catgy_high_sale

                  services  catgy_high_sale
0               Air Sports         99316.90
1            Combat Sports        164730.67
2                  Dancing         42603.71
3       Exercise & Fitness        766463.87
4                    Games        374932.70
5               Gymnastics        327225.34
6             Indoor Games        288506.04
7                  Jumping        205842.67
8   Outdoor Play Equipment        294728.28
9       Outdoor Recreation        846678.64
10                 Puzzles         61564.75
11          Racquet Sports        166976.06
12             Team Sports        617461.38
13            Water Sports        531815.97
14           Winter Sports        321973.56

In [14]:
#15.Which services are most popular by transaction count?
trans_cnt = df['services'].value_counts()
trans_cnt

services
Outdoor Recreation        8383
Exercise & Fitness        7394
Team Sports               6010
Water Sports              5219
Games                     3666
Gymnastics                3196
Winter Sports             3181
Outdoor Play Equipment    2910
Indoor Games              2799
Jumping                   2015
Combat Sports             1630
Racquet Sports            1611
Air Sports                 960
Puzzles                    612
Dancing                    414
Name: count, dtype: int64

In [15]:
#16.For each service, which product type is purchased most frequently?
purchased = df.groupby(['services','products_used']).size().reset_index(name="purchased")
purchased

          services products_used  purchased
0       Air Sports     Air Suits        191
1       Air Sports  Hang Gliding        369
2       Air Sports    Parachutes        400
3    Combat Sports        Boxing        431
4    Combat Sports       Fencing        394
..             ...           ...        ...
120  Winter Sports          Luge        413
121  Winter Sports      Sledding        395
122  Winter Sports  Snowboarding        374
123  Winter Sports  Snowmobiling        380
124  Winter Sports   Snowshoeing        409

[125 rows x 3 columns]

In [16]:
#17.What is the average transaction amount per product type?
df.groupby('products_used')['t_amt'].mean()

products_used
Abdominal Equipment    105.362798
Air Hockey             103.775478
Air Suits              101.421832
Archery                 97.345564
Badminton              108.441138
                          ...
Wetsuits               102.042775
Whitewater Rafting     102.877744
Windsurfing            104.161453
Wrestling               97.895364
Yoga & Pilates         107.668784
Name: t_amt, Length: 125, dtype: float64

In [17]:
#18.Are there specific services where customers spend significantly more?
high_ser = df.groupby("services")['t_amt'].mean().reset_index(name="high_ser").head(5)
high_ser

             services    high_ser
0          Air Sports  103.455104
1       Combat Sports  101.061761
2             Dancing  102.907512
3  Exercise & Fitness  103.660247
4               Games  102.272968

In [18]:
#19.Which state has the highest total sales?
df.groupby('state')['t_amt'].sum()

state
Alabama                 116015.34
Arizona                 131291.33
California              702346.23
Colorado                178299.70
Connecticut              91083.70
District of Columbia     49720.36
Florida                 274858.95
Georgia                  89437.01
Hawaii                   42950.01
Idaho                    45031.14
Illinois                134022.53
Indiana                  44615.71
Iowa                     46807.73
Kansas                   92713.35
Kentucky                 90281.05
Louisiana                48836.11
Maryland                 44926.59
Massachusetts           143744.66
Michigan                 98196.70
Minnesota                92497.85
Mississippi              47874.66
Missouri                132471.38
Nebraska                 91556.21
Nevada                   95418.42
New Jersey              136848.48
New York                 98755.56
North Carolina           87372.13
Ohio                    188613.87
Oklahoma                 47668.08
Oregon                  187052.05
Pennsylvania             90442.91
South Carolina           94946.24
Tennessee               177685.79
Texas                   541267.24
Utah                     92071.16
Virginia                144447.26
Washington              181508.87
Wisconsin               117144.18
Name: t_amt, dtype: float64

In [19]:
#20.Which city records the highest number of transactions?
high_trans_city = df['city'].value_counts()
high_trans_city

city
Pasadena            939
Columbia            920
Kansas City         912
Columbus            906
Buffalo             507
                   ...
Austin              410
West Valley City    409
Gilbert             400
Green Bay           231
Birmingham          214
Name: count, Length: 108, dtype: int64

In [20]:
#21.What is the average spending per transaction in each state?
df.groupby('state')['t_amt'].mean()

state
Alabama                 102.487049
Arizona                 102.172241
California              102.652182
Colorado                101.537415
Connecticut              99.982108
District of Columbia    103.800334
Florida                 103.136567
Georgia                 102.330675
Hawaii                  101.536667
Idaho                    98.969538
Illinois                100.166315
Indiana                 100.712664
Iowa                    103.100727
Kansas                  101.436926
Kentucky                104.130392
Louisiana               103.466335
Maryland                100.506913
Massachusetts           104.541571
Michigan                101.547777
Minnesota               103.465157
Mississippi             101.214926
Missouri                100.969040
Nebraska                101.955690
Nevada                  105.434718
New Jersey              103.438005
New York                100.259452
North Carolina          103.033172
Ohio                    101.350817
Oklahoma                104.995771
Oregon                  102.438143
Pennsylvania            102.776034
South Carolina          103.540065
Tennessee                99.265804
Texas                   101.379891
Utah                    104.507560
Virginia                104.976206
Washington              101.401603
Wisconsin               101.953159
Name: t_amt, dtype: float64

In [21]:
#22.Are certain services more popular in specific states?
df.groupby(['state','services']).size()

state      services
Alabama    Air Sports             21
           Combat Sports          44
           Dancing                 8
           Exercise & Fitness    160
           Games                  80
                                ...
Wisconsin  Puzzles                15
           Racquet Sports         34
           Team Sports           152
           Water Sports          126
           Winter Sports          64
Length: 570, dtype: int64

In [22]:
#23.Which states buy the most Outdoor Recreation products?
df[df['services']=='Outdoor Recreation'].groupby('state')['t_amt'].sum()

state
Alabama                  18197.03
Arizona                  24426.25
California              120605.09
Colorado                 27605.07
Connecticut              14592.22
District of Columbia      7046.35
Florida                  47959.38
Georgia                  15912.77
Hawaii                    7513.52
Idaho                     7885.45
Illinois                 22933.09
Indiana                   9677.66
Iowa                      7765.27
Kansas                   15869.04
Kentucky                 16532.71
Louisiana                 8480.19
Maryland                  8085.69
Massachusetts            26458.03
Michigan                 13883.05
Minnesota                17928.51
Mississippi               8201.95
Missouri                 22301.50
Nebraska                 14962.41
Nevada                   14427.91
New Jersey               22091.40
New York                 14393.36
North Carolina           14530.52
Ohio                     30917.35
Oklahoma                  6483.88
Oregon                   32892.83
Pennsylvania             15271.72
South Carolina           16050.35
Tennessee                31080.93
Texas                    81616.93
Utah                     14178.02
Virginia                 18931.03
Washington               29612.15
Wisconsin                19378.03
Name: t_amt, dtype: float64

In [23]:
#24.Compare average spending between California and Texas customers.
df[df['state'].isin(['California','Texas'])].groupby('state')['t_amt'].mean()

state
California    102.652182
Texas         101.379891
Name: t_amt, dtype: float64

In [24]:
#25.Which quarter of the year saw the highest sales?
df['t_date'] = pd.to_datetime(df['t_date'], errors='coerce')
df['quarter'] = df['t_date'].dt.quarter
df.groupby('quarter')['t_amt'].sum()

quarter
1    1278092.37
2    1274397.37
3    1303137.44
4    1255193.36
Name: t_amt, dtype: float64

In [25]:
#26.How does total sales vary month by month?
#27.What is the total number of transactions per month?
df['month'] = df['t_date'].dt.month
df.groupby('month')['t_amt'].sum()
df.groupby('month').size()

month
1     4268
2     3834
3     4360
4     4175
5     4205
6     4171
7     4252
8     4250
9     4160
10    4181
11    3994
12    4150
dtype: int64

In [26]:
#28.Is there a particular season when sports equipment sales spike?
# Converting date to datetime
df['t_date'] = pd.to_datetime(df['t_date'])

# Extracting month
df['month'] = df['t_date'].dt.month

# Filtering required services
sports_df = df[df['services'].isin([
    'Team Sports',
    'Outdoor Recreation',
    'Exercise & Fitness'
])]

# Monthly revenue for these services
monthly_revenue = sports_df.groupby(['services', 'month'])['t_amt'].sum()

# Sort to find highest revenue months
monthly_revenue.sort_values(ascending=False).reset_index(name="monthly_revenue")

              services  month  monthly_revenue
0   Outdoor Recreation      3         73573.64
1   Outdoor Recreation     10         73237.22
2   Outdoor Recreation      7         73043.80
3   Outdoor Recreation      1         71477.05
4   Outdoor Recreation      5         71344.42
5   Outdoor Recreation      4         70476.11
6   Outdoor Recreation      6         70348.35
7   Outdoor Recreation      8         69805.33
8   Outdoor Recreation     12         69329.35
9   Exercise & Fitness      9         69272.93
10  Outdoor Recreation      9         68657.20
11  Exercise & Fitness      5         68038.70
12  Outdoor Recreation      2         67789.52
13  Outdoor Recreation     11         67596.65
14  Exercise & Fitness      4         67054.83
15  Exercise & Fitness      1         66298.43
16  Exercise & Fitness      3         65160.83
17  Exercise & Fitness      7         64658.25
18  Exercise & Fitness     10         62446.88
19  Exercise & Fitness      8         62369.40
20  Exercise & Fitness     11         60763.29
21  Exercise & Fitness     12         60218.95
22  Exercise & Fitness      2         60185.34
23  Exercise & Fitness      6         59996.04
24         Team Sports      8         57153.34
25         Team Sports      3         55662.86
26         Team Sports      4         53772.54
27         Team Sports      9         53187.57
28         Team Sports      1         52331.01
29         Team Sports      5         52269.35
30         Team Sports      6         52236.93
31         Team Sports     10         51594.81
32         Team Sports      7         48666.12
33         Team Sports      2         48418.82
34         Team Sports     12         46741.93
35         Team Sports     11         45426.10

In [27]:
#29.How many transactions were done using credit?
credit_tran = df[df['t_details']=='credit'].shape[0]
credit_tran

43151

In [28]:
#30.What is the total revenue generated from credit transactions?
credit_revenue = df[df['t_details']=='credit']['t_amt'].sum()
credit_revenue

4923134.930000001

In [29]:
#31.Is there a difference in average spending between credit and debit customers?
df.groupby('t_details')['t_amt'].mean()

t_details
cash       27.403360
credit    114.090865
Name: t_amt, dtype: float64

In [30]:
#32.Which states or cities should the company focus on for marketing high-value products?
df.groupby(['state','city'])['t_amt'].mean()

state       city
Alabama     Birmingham     96.319019
            Huntsville    105.721088
            Montgomery    102.264298
Arizona     Gilbert       101.021150
            Phoenix       102.271626
                             ...
Washington  Seattle       100.109955
            Vancouver     102.505022
Wisconsin   Green Bay     103.407922
            Madison       101.351498
            Milwaukee     101.838604
Name: t_amt, Length: 112, dtype: float64

In [31]:
#33.Should more inventory be stocked for Exercise & Fitness products given their popularity?

ex_df = df[df['services'] == 'Exercise & Fitness']

# 1. Transaction Count
transaction_count = ex_df.shape[0]

# 2. Total Revenue
total_revenue = ex_df['t_amt'].sum()

# 3. Monthly Growth Trend
monthly_trend = ex_df.groupby('month')['t_amt'].sum().sort_index()

print("Transaction Count:", transaction_count)
print("Total Revenue:", total_revenue)
print("\nMonthly Sales Trend:")
print(monthly_trend)

Transaction Count: 7394
Total Revenue: 766463.87

Monthly Sales Trend:
month
1     66298.43
2     60185.34
3     65160.83
4     67054.83
5     68038.70
6     59996.04
7     64658.25
8     62369.40
9     69272.93
10    62446.88
11    60763.29
12    60218.95
Name: t_amt, dtype: float64

In [32]:
#34.Are there product categories with high sales but low average transaction amounts?
sales = df.groupby('services')['t_amt'].sum()
avg = df.groupby('services')['t_amt'].mean()
sales
avg

services
Air Sports                103.455104
Combat Sports             101.061761
Dancing                   102.907512
Exercise & Fitness        103.660247
Games                     102.272968
Gymnastics                102.385901
Indoor Games              103.074684
Jumping                   102.155171
Outdoor Play Equipment    101.281196
Outdoor Recreation        100.999480
Puzzles                   100.595997
Racquet Sports            103.647461
Team Sports               102.738998
Water Sports              101.899975
Winter Sports             101.217718
Name: t_amt, dtype: float64

In [33]:
#35.Are there underperforming service categories that need promotional offers?

# Ensure amount is numeric
df['t_amt'] = pd.to_numeric(df['t_amt'], errors='coerce')

# Total revenue per service
service_revenue = df.groupby('services')['t_amt'].sum()

# Sort ascending to find lowest revenue categories
underperforming = service_revenue.sort_values().head(5).reset_index(name="underperforming")

print("Underperforming Services (Lowest Revenue):")
print(underperforming)

Underperforming Services (Lowest Revenue):
         services  underperforming
0         Dancing         42603.71
1         Puzzles         61564.75
2      Air Sports         99316.90
3   Combat Sports        164730.67
4  Racquet Sports        166976.06